dx = 0.0002; %шаг интегрирования
eps = 0.00005; %точность эпсилон
i = 0; %переменная - итератор


for x = -2:dx:2;    %область определения для функции
    i = i + 1;
    
    if x < -1       %промежуток для x<-1
        y(i) = 0;  %y - матрица, где i - индекс
    end
    
    if (x >= -1) && (x < 1) %цикл на интервале 
        y(i) = 0;
        for z = -2: dx : x %начало диферинцирования
           y(i) = y(i) + cos(z)+ z*sin(z);
        end
        y(i)=y(i)*dx;       
    end
    if (x>=1)&&(x<=2)  %цикл на интервале 
        y(i)=0;
        b = 1;
        n=1;
        while abs(b)>=eps %проверка на условие
            n=n+1;
            q = ((-1)^n*x^(2*n+1))/factorial(2*n+1);
            b= b*q;
            y(i) = b; %присваивание значения
        end
        
    end
    
end
x = -2:dx:2;
plot(x,y) %рисование графика
xlabel x
ylabel y
grid on

